
public class Alphabets {
	private static final char[] jpHg = {
		'あ','い','う','え','お',
		'か','き','く','け','こ',
		'が','ぎ','ぐ','げ','ご',
		'さ','し','す','せ','そ',
		'ざ','じ','ず','ぜ','ぞ',
		'た','ち','つ','て','と',
		'だ','ぢ','づ','で','ど',
		'な','に','ぬ','ね','の',
		'は','ひ','ふ','へ','ほ',
		'ば','び','ぶ','べ','ぼ',
		'ぱ','ぴ','ぷ','ぺ','ぽ',
		'ま','み','む','め','も',
		'ら','り','る','れ','ろ',
		'や','ゆ','よ','わ','を','ん'};
		
	private static final char[] jpKn = {
		'ア','イ','ウ','エ','オ',
		'カ','キ','ク','ケ','コ',
		'ガ','ギ','グ','ゲ','ゴ',
		'サ','シ','ス','セ','ソ',
		'ザ','ジ','ズ','ゼ','ゾ',
		'タ','チ','ツ','テ','ト',
		'ダ','ヂ','ヅ','デ','ド',
		'ナ','ニ','ヌ','ネ','ノ',
		'ハ','ヒ','フ','ヘ','ホ',
		'バ','ビ','ブ','ベ','ボ',
		'パ','ピ','プ','ペ','ポ',
		'マ','ミ','ム','メ','モ',
		'ラ','リ','ル','レ','ロ',
		'ヤ','ユ','ヨ','ワ','ヲ','ン'};
			
	public char[] getJpHg() {
		return jpHg;
	}
	
	public char[] getJpKn() {
		return jpKn;
	}
}
